3devo/Arduino-3devo/avr/boards.txt
devoboard.name=3Devo Devoboard

devoboard.vid.0=0x16D0
devoboard.pid.0=0x0C5B

devoboard.upload.tool=arduino:avrdude
devoboard.upload.protocol=wiring
devoboard.upload.speed=115200
devoboard.upload.maximum_size=253952
devoboard.upload.maximum_data_size=8192

# Compared to Arduino Mega2560 fuses, BODLEVEL is raised from 2.7, and
# JTAGEN and EESAVE are enabled.

# Low power crystal oscillator 8-16Mhz, 16K CK + 65ms
devoboard.bootloader.low_fuses=0xFF
# JTAGEN, SPIEN, EESAVE, BOOTSZ=8192bytes, BOOTRST
devoboard.bootloader.high_fuses=0x90
# BODLEVEL=4.3V
devoboard.bootloader.extended_fuses=0xFC
devoboard.bootloader.unlock_bits=0x3F
devoboard.bootloader.lock_bits=0x0F
devoboard.bootloader.tool=arduino:avrdude
#devoboard.bootloader.file=stk500v2/stk500boot_v2_mega2560.hex

devoboard.build.mcu=atmega2560
devoboard.build.f_cpu=16000000L
devoboard.build.core=arduino:arduino
devoboard.build.variant=mega
devoboard.build.board=AVR_DEVOBOARD
